[
  {
    "id": "blog-22",
    "image": "https://shengez.co.za/Images/blog/blog-22/mc1.webp",
    "alt": "Matric 2024 100% pass rate - shengeza high school",
    "title": "Shengeza High School's 100% NSC Pass Rate",
    "short_description": "On the 5th of March 2025, Shengeza High School proudly hosted a prestigious event to celebrate the outstanding achievements of the Grade 12 Class of 2024. This milestone was truly historic, as the school attained a 100% matric pass rate for the first time since the introduction of matric in 1999.",
    "content": "<img src=\"https://shengez.co.za/Images/blog/blog-22/mc2.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br>The celebration brought together various esteemed stakeholders, including the School Governing Body (SGB), teachers, support staff, Representative Council of Learners (RCL), religious leaders, and traditional leaders. Their presence emphasized the collective effort that contributed to this remarkable success.<br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc3.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br><strong>Keynote Address & Appreciation</strong><br>The event was graced by Pastor P. Masiza, who delivered a powerful keynote address, inspiring the school to continue striving for excellence. In recognition of their dedication and hard work, all Grade 12 educators received tokens of appreciation for their role in achieving subject performances ranging from 75% to 100%.<br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc4.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br><strong>Subject Performance Highlights</strong><br><br><strong>🏆 Top Performing Subjects (100%)</strong><br>1️⃣ IsiZulu Home Language – 44 distinctions 🎖️ (Mrs. BQ Ntuli & Miss TC Mthembu)<br>2️⃣ Life Orientation – 5 distinctions (Miss KT Ngubane)<br>3️⃣ History – 5 distinctions (Mr. NC Ngubane)<br>4️⃣ Agricultural Sciences – 2 distinctions (Miss ST Nhleko)<br>5️⃣ Life Sciences – (Mrs. NP Mathenjwa)<br>6️⃣ English First Additional Language – (Mr. SS Fakude)<br>7️⃣ Tourism – 1 distinction (Mr. SJ Mthembu)<br>8️⃣ Physical Sciences – (Mrs. JAE Willemse)<br><br><strong>📊 Other Notable Performances</strong><br>✅ Business Studies – 94.1% pass rate with 9 distinctions (Mr. SK Masimula)<br>✅ Mathematical Literacy – 94.1% pass rate with 1 distinction (Mrs. ST Ntuli)<br>✅ Mathematics – 86.9% pass rate (Mr. DB Ndlanzi)<br>✅ Accounting – 75% pass rate (Mr. NJ Zwane)<br>✅ Economics – 75% pass rate (Mr. MG Mthembu & Mr. Sithole SR)<br><br><strong>Overall Results</strong><br>📈 Total Pass Rate: 100%<br>🎓 Bachelor Passes: 59<br>📚 Diploma Passes: 28<br>📜 Higher Certificate Passes: 4<br><br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc5.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc6.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc9.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br>This achievement is a testament to the hard work, resilience, and dedication of our learners, educators, parents, and the entire school community under the exceptional leadership of Principal Mr. Ngubane.<br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc7.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc10.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br>Shengeza High School has set a new standard of excellence, proving that with commitment and unity, greatness is achievable! Congratulations once again to the Class of 2024 your success has paved the way for future generations!<br><img src=\"https://shengez.co.za/Images/blog/blog-22/mc8.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\">"
  },
  {
    "id": "blog-21",
    "image": "https://shengez.co.za/Images/blog/blog-21/dut7.webp",
    "alt": "Matric 2024 100% pass rate - shengeza high school",
    "title": "Shengeza High School Achieves 100% Matric Pass Rate!",
    "short_description": "We are overjoyed to announce a historic milestone for Shengeza High School! The Matric Class of 2024 has achieved a 100% pass rate the first in our school’s history since its establishment in 1995, with the first matric class in 1999. This outstanding achievement is a testament to years of dedication, teamwork, and a shared vision for success.",
    "content": "<img src=\"https://shengez.co.za/Images/blog/blog-21/s100p1.webp\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"><br>Under the visionary leadership of our principal, Mr. Ngubane, this momentous success reflects the hard work and commitment of every individual who has walked the journey with us. Our learners, teachers, parents, and the broader community have all played an integral role in this triumph.<br><video controls width=\"100%\" src=\"https://shengez.co.za/Images/blog/blog-21/s100v3.mp4\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"></video><br>The Class of 2024 has set a new benchmark for excellence at Shengeza High School. Their perseverance, discipline, and resilience have proven that with focus and determination, greatness is attainable. Teachers worked tirelessly, ensuring learners were well-prepared, while parents provided unwavering support, creating an environment where academic success could thrive.<br><video controls width=\"100%\" src=\"https://shengez.co.za/Images/blog/blog-21/s100v4.mp4\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"></video><br>This achievement is more than just numbers; it is a celebration of dreams realized, potential unlocked, and a brighter future paved for our learners. As we bask in this proud moment, we are reminded that this is only the beginning. With this historic success as our foundation, we are inspired to aim even higher.<br><video controls width=\"100%\" src=\"https://shengez.co.za/Images/blog/blog-21/s100v2.mp4\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"></video><br>We extend our heartfelt gratitude to everyone who contributed to this milestone. Together, we are shaping a legacy of excellence at Shengeza High School. Here's to many more years of success! 🎉<br><video controls width=\"100%\" src=\"https://shengez.co.za/Images/blog/blog-21/s100v1.mp4\" id=\"md-img\" alt=\"Matric 2024 100% pass rate - shengeza high school\"></video><br>Congratulations, Matric Class of 2024 you’ve made history!"
  },
  {
    "id": "blog-20",
    "image": "https://shengez.co.za/Images/blog/blog-20/mp14.webp",
    "alt": "Mpumalanga staff trip - shengeza high school",
    "title": "Shengeza High Staff Team Building in Mpumalanga",
    "short_description": "22 to 24 November 2024, the staff of Shengeza High School embarked on an exciting team-building trip to the breathtaking Mpumalanga province.",
    "content": "<img src=\"https://shengez.co.za/Images/blog/blog-20/mp1.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp2.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp3.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp4.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br>This enriching experience provided an opportunity for our dedicated educators to strengthen bonds, rejuvenate, and foster collaboration in a refreshing environment.<br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp5.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp6.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp7.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp8.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br>The trip was a blend of relaxation and team-focused activities, leaving everyone inspired and united. Here’s to the Shengeza team, continually working together to provide the best for our learners!<br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp13.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp10.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp11.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-20/mp12.webp\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"><br><video controls width=\"100%\" src=\"https://shengez.co.za/Images/blog/blog-20/mp15v.mp4\" id=\"md-img\" alt=\"Mpumalanga staff trip - shengeza high school\"></video>"
  },
  {
    "id": "blog-19",
    "image": "https://shengez.co.za/Images/blog/blog-19/sm2.webp",
    "alt": "Heartfelt Donation - shengeza high school",
    "title": "Senzo Masinga and Siblings Give Back to Shengeza High",
    "short_description": "On 20 September 2024, Shengeza High School had the honor of welcoming Senzo Masinga along with his siblings, Nomkhosi and Manqoba, as they visited the school for a meaningful and touching gesture. In celebration of Senzo’s birthday, and in a special tribute to their late mother who was a dedicated nurse, the Masinga siblings donated sanitary pads and roll-on deodorants to our school.",
    "content": "<img src=\"https://shengez.co.za/Images/blog/blog-19/sm4.webp\" id=\"md-img\" alt=\"Heartfelt Donation - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-19/sm6.webp\" id=\"md-img\" alt=\"Heartfelt Donation - shengeza high school\"><br>This act of kindness serves as a reminder of the lasting impact that caring individuals can have on their community, especially when done in remembrance of loved ones. Senzo’s initiative not only benefits our learners but also highlights the importance of paying it forward and supporting one another.<br><img src=\"https://shengez.co.za/Images/blog/blog-19/sm7.webp\" id=\"md-img\" alt=\"Heartfelt Donation - shengeza high school\"><br><img src=\"https://shengez.co.za/Images/blog/blog-19/sm8.webp\" id=\"md-img\" alt=\"Heartfelt Donation - shengeza high school\"><br>We extend our heartfelt thanks to Senzo, Nomkhosi, and Manqoba for their generous donation. Your thoughtful contribution will make a significant difference in the lives of our learners, and your mother’s legacy lives on through this act of compassion.<br><img src=\"https://shengez.co.za/Images/blog/blog-19/sm9.webp\" id=\"md-img\" alt=\"Heartfelt Donation - shengeza high school\">"
  },
  {
    "id": "blog-2",
    "image": "https://shengez.co.za/Images/blog/blog-2/md-23.webp",
    "alt": "Matric Dance 2023 - shengeza high school",
    "title": "Matric Dance 2023",
    "short_description": "In the heart of South Africa, nestled amidst the beauty of nature, Shengeza High School's Class of 2023 bid farewell to their high school journey in a spectacular fashion. The venue: Phumobala Lodge, a picturesque setting that provided the perfect backdrop for an unforgettable day.",
    "content": "<img src=\"https://shengez.co.za/Images/blog/blog-2/md-13.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>As the sun dipped below the horizon, excitement crackled in the air. Learners, staff, and parents alike gathered, adorned in their finest attire, ready to celebrate this milestone moment. The atmosphere was electric, buzzing with anticipation and nostalgia.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-4.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>Dressed in the top and hottest outfits of the season, the learners radiated confidence and elegance. Each attire was a reflection of their unique personalities, showcasing their individual styles while collectively exuding sophistication and charm. From sleek suits to dazzling dresses, every ensemble spoke volumes about the journey they had undertaken together.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-19.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>Against the backdrop of the Lodge's enchanting scenery, laughter and joy filled the air as learners reminisced about cherished memories and shared dreams for the future. It was a day where time seemed to stand still, allowing everyone to savor the magic of the moment.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-21.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>The dance floor became a stage where dreams took flight, as learners twirled and spun to the rhythm of the music, their smiles illuminating the day. For a brief moment, worries and stresses faded away, replaced by pure jubilation and camaraderie.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-14.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>But it wasn't just the learners who were caught up in the enchantment of the day. Staff members, who had guided and supported these young individuals throughout their academic journey, looked on with pride and fondness. For them, witnessing the culmination of years of hard work and dedication was a moment of profound satisfaction.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-25.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>Parents, too, shared in the joy of seeing their children blossom into confident, capable young adults. As they watched their sons and daughters dance under the starlit sky, hearts swelled with pride and love, knowing that this was just the beginning of a new chapter filled with endless possibilities.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-6.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>As the final moments of the occasion approached, and the last notes of music faded away, there lingered a sense of bittersweet nostalgia. The matric dance at Phumobala Lodge had been more than just a celebration; it was a testament to the bonds forged, the memories created, and the futures awaiting these remarkable individuals.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-7.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\"><br>For Shengeza High School's Class of 2023, the matric dance was not merely an event; it was a magical journey—a day to remember, cherish, and carry in their hearts forever. And as they bid farewell to their alma mater, they stepped into the world with heads held high, ready to conquer whatever adventures lay ahead.<br><img src=\"https://shengez.co.za/Images/blog/blog-2/md-16.webp\" id=\"md-img\" alt=\"Matric Dance 2023 - shengeza high school\">"
  },
  {
    "id": "blog-1",
    "image": "https://shengez.co.za/Images/blog/blog-1/tc-6.webp",
    "alt": "Staff in Capetown 2022 - shengeza high school",
    "title": "Our Staff in Capetown 2022",
    "short_description": "Amidst the bustling streets and breathtaking landscapes of Cape Town, the dedicated educators of Shengeza High School embarked on a journey of camaraderie, unity, and renewal. Their destination: a staff team-building retreat aimed at fostering stronger relationships and promoting teamwork among the school's faculty.",
    "content": "<img src=\"https://shengez.co.za/Images/blog/blog-1/tc-1.webp\" id=\"md-img\" alt=\"Staff in Capetown 2022 - shengeza high school\"><br>The trip wasn't just about sightseeing and relaxation; it was a deliberate effort to cultivate unity, solidarity, and cohesion among the school's educators. Through a series of team-building activities and workshops, the staff delved into the essence of collaboration and cooperation, learning to communicate effectively, trust one another, and work towards common goals.<br><img src=\"https://shengez.co.za/Images/blog/blog-1/tc-2.webp\" id=\"md-img\" alt=\"Staff in Capetown 2022 - shengeza high school\"><br>But it wasn't just about the tasks at hand; it was about the connections forged along the way. As they laughed, learned, and supported one another, barriers dissolved, and friendships flourished. From seasoned educators to newcomers, everyone contributed their unique strengths and perspectives, enriching the collective experience.<br><img src=\"https://shengez.co.za/Images/blog/blog-1/tc-3.webp\" id=\"md-img\" alt=\"Staff in Capetown 2022 - shengeza high school\"><br>As the retreat drew to a close, and the staff gathered for a final reflection session, there was a palpable sense of transformation in the air. What had begun as a simple trip to Cape Town had evolved into a profound journey of self-discovery, growth, and unity.<br><img src=\"https://shengez.co.za/Images/blog/blog-1/tc-4.webp\" id=\"md-img\" alt=\"Staff in Capetown 2022 - shengeza high school\"><br>Armed with newfound insights and strengthened relationships, the educators of Shengeza High School returned home, ready to face the challenges and opportunities that lay ahead. For in the end, it wasn't just about the destination; it was about the journey—and the bonds that had been forged along the way.<br><img src=\"https://shengez.co.za/Images/blog/blog-1/tc-5.webp\" id=\"md-img\" alt=\"Staff in Capetown 2022 - shengeza high school\">"
  }
]